<?php
return [
    'header' => [
        'cart' => 'Себет',
        'exit' => 'Шығу'
    ],
    'navbar' => [
        'main' => 'Басты бет',
        'myTickets' => 'Менің билеттерім',
        'search' => 'Іздеу',
        'help' => 'Көмек',
        'profile' => 'Профиль'
    ],
    'footer' => [
        'slogan' => 'Сіздің барлық көлік түрлеріне саяхатты жоспарлаудағы сенімді серіктесіңіз.',
        'navigationTitle' => 'Навигация',
        'copyright' => '© 2024 NTicket. Барлық құқықтар қорғалған.'
    ],
    'mainPage' => [
        'pageTitle' => 'Басты бет',
        'banner' => [
            'title' => 'Nticket-ке қош келдіңіз',
            'text' => 'Nticket-бұл қоғамдық көліктің барлық түрлеріне, соның ішінде таксилерге, пойыздарға және ұшақтарға билеттерді брондауға арналған бірегей платформа. Біз өз клиенттерімізге толыққанды маршруттар үшін гибридті Билеттерді сатып алуға мүмкіндік беретін инновациялық саяхат тәсілін ұсынамыз. Біздің миссиямыз: саяхатты жоспарлау процесін мүмкіндігінше ыңғайлы және тиімді ету арқылы жеңілдету. Ticket көмегімен сіз әртүрлі көлік түрлеріне жеке Билеттерді сатып алу қажеттілігін ұмыта аласыз. Біздің қызмет үйден шыққаннан бастап межелі жерге келгенге дейін бүкіл маршрутты бір билетке біріктіруге мүмкіндік береді.'
        ],
        'guide' => [
            'title' => 'Қалай брондау керек',
            'text' => 'Билеттерді брондау ешқашан оңай болған емес! Келесі рейске тапсырыс беруге көмектесетін қадамдық нұсқаулық',
            'points' => [
                'search' => [
                    'title' => 'Іздеу үшін таңдау',
                    'text' => 'Қажетті бағыт пен Сапар күндерін енгізу үшін іздеу жолағын пайдаланыңыз'
                ],
                'booking' => [
                    'title' => 'Баратын жерді таңдаңыз',
                    'text' => 'Қажетті рейсті тапқаннан кейін оны таңдап, брондауды жалғастырыңыз'
                ],
                'payment' => [
                    'title' => 'Брондау оңай',
                    'text' => 'Төлеміңіз расталғаннан кейін Сіз электронды билетті электрондық пошта арқылы аласыз'
                ]
            ]
        ],
        'advantage' => [
            'title' => 'Біздің артықшылығымыз',
            'points' => [
                'hybrid' => [
                    'title' => 'Гибридті билеттер',
                    'text' => 'Жеке пойыз, ұшақ және такси билеттерін сатып алуды ұмытыңыз. Біздің платформа көліктің барлық түрлерін бір ыңғайлы билетке біріктіруге мүмкіндік береді.'
                ],
                'search' => [
                    'title' => 'Іздеу жүйесі',
                    'text' => "Біздің интеллектуалды іздеуіміз әртүрлі көлік түрлерін, жол жүру уақытын және құнын ескере отырып, оңтайлы маршрутты табуға көмектеседі. Сіз ұсынылған опцияны таңдай аласыз немесе маршрутты өз қалауыңыз бойынша реттей аласыз."
                ],
                'comfort' => [
                    'title' => "Қарапайымдылық пен ыңғайлылық",
                    'text' => 'Біз билеттерді брондау процесін мүмкіндігінше қарапайым және ыңғайлы етеміз. Біздің интуитивті платформамыз сізге маршрутты тез және оңай таңдауға, қажетті деректерді енгізуге және төлемді аяқтауға мүмкіндік береді.'
                ],
                'money' => [
                    'title' => "Уақыт пен ақшаны үнемдеу",
                    'text' => 'NTicket көмегімен сіз билеттерді іздеуге және сатып алуға уақытты үнемдейсіз, сонымен қатар оңтайлы маршрут таңдауы мен арнайы ұсыныстардың арқасында ақша үнемдей аласыз'
                ]
            ]
        ],
        'request' => [
            'title' => 'Өтініш жіберіңіз',
            'text' => 'Толық кеңес алу үшін осы формаға деректерді енгізіңіз біз сізге жақын арада қайта қоңырау шаламыз',
            'inputs' => [
                'name' => [
                    'label' => 'Аты:',
                    'placeholder' => 'Атыңызды енгізіңіз'
                ],
                'phone' => [
                    'label' => 'Телефон:',
                    'placeholder' => 'Телефон нөміріңізді енгізіңіз'
                ]
            ],
            'submit' => 'Жіберу'
        ],
        'mission' => [
            'title' => 'Біздің миссиямыз',
            'text' => 'Біз саяхатты жоспарлау процесін клиенттеріміз үшін мүмкіндігінше ыңғайлы және тиімді ету арқылы жеңілдетуге тырысамыз. Nticket көмегімен сіз әртүрлі көлік түрлеріне жеке Билеттерді сатып алу қажеттілігін ұмыта аласыз - бізге сеніңіз және саяхаттаудың ыңғайлылығынан ләззат алыңыз!'
        ],
        'modal' => [
            'title' => 'Кеңес алуға өтінім',
            'close' => 'Жабу'
        ]
    ],

    'bankCard' => [
        'title' => 'Банк картасы',
        'inputs' => [
            'fullName' => [
                'label' => 'Аты Тегі',
                'placeholder' => 'Аты-жөніңізді енгізіңіз'
            ],
            'number' => [
                'label' => 'Карта нөмірі',
                'placeholder' => 'Карта нөміріңізді енгізіңіз'
            ],
            'cvv' => [
                'label' => 'СVV',
                'placeholder' => 'Cvv нөміріңізді енгізіңіз'
            ]
        ],
        'buttons' => [
            'submit' => 'Карта деректерін жаңарту',
            'profile' => 'Тіркелгі профилі',
            'idCard' => 'Жеке куәлік'
        ],
        'modal' => [
            'title' => 'Банк картасын жаңарту',
            'close' => 'Жабу'
        ]
    ],

    'buyTicket' => [
        'title' => 'Гибридті билетті сатып алу және жасау',
        'text' => 'Бастау үшін гибридті билетті сатып алу үшін Сіз сатып алатын гибридті билеттердің санын көрсетуіңіз керек',
        'inputLabels' => [
            'price' => 'Билет бағасы:',
            'count' => 'Билеттер саны:',
            'sum' => 'Төлемге жиыны:'
        ],
        'buy' => 'Сатып алу'
    ],
    
    'cart' => [
        'title' => 'Себет',
        'text' => 'Бұл маршруттар себеті гибридті билет жасау үшін арнайы жасалған. Мұнда сіз өзіңіз қалаған маршруттарды таңдап оларды бір гибридті маршрутқа біріктіруіңіз керек',
        'card' => [
            'title' => 'Сапар туралы мәліметтер',
            'info' => [
                'from' => 'Кету орны',
                'to' => 'Келу орны',
                'departureTime' => 'Кету күні мен уақыты',
                'arrivalTime' => 'Келу күні мен уақыты',
                'price' => 'Бағасы',
                'seats' => 'Орындар қалды',
                'organizator' => 'Ұйымдастыру',
                'transport' => [
                    'text' => 'Көлік',
                    'type' => [
                        'airplane' => 'Ұшақ',
                        'bus' => 'Автобус',
                        'train' => 'Пойыз'
                    ]
                ],
            ],
            'select' => 'Маршрутты таңдаңыз',
            'submit' => 'Жіберу',
            'modal' => [
                'title' => 'Бағыт',
                'close' => 'Жабу'
            ]
        ]
    ],

    'chatHelp' => [
        'title' => 'Сұрақ-жауап',
        'text' => 'Осы форма бойынша сұрақтарыңызды қойыңыз біз сіз қойған сұраққа жауап береміз',
        'form' => [
            'title' => 'Өз сұрағыңызды қойыңыз',
            'label' => 'Сіздің сұрағыңыз:',
            'placeholder' => 'Сіздің сұрағыңызды қойыңыз',
            'submit' => 'Сұрақ жіберу'
        ],
        'noAnswer' => 'Жауап жоқ',
        'noQuestionTitle' => 'Сіз әлі сұрақтар қойған жоқсыз',
        'modal' => [
            'title' => 'Сұрақ',
            'close' => 'Жабу'
        ]
    ],

    'idCard' => [
        'title' => 'Жеке куәлік',
        'inputs' => [
            'name' => [
                'label' => 'Аты',
                'placeholder' => 'Атыңызды енгізіңіз'
            ],
            'surname' => [
                'label' => 'Тегі',
                'placeholder' => 'Фамилияңызды енгізіңіз'
            ],
            'middleName' => [
                'label' => 'Әкесінің аты (міндетті емес)',
                'placeholder' => 'Әкеңіздің атын енгізіңіз'
            ],
            'iin' => [
                'label' => 'ЖСН',
                'placeholder' => 'ЖСН енгізіңіз'
            ],
            'number' => [
                'label' => 'Құжат нөмірі',
                'placeholder' => 'Құжат нөміріңізді енгізіңіз'
            ],
            'birthDate' => [
                'label' => 'Туған күні'
            ],
            'nationality' => [
                'label' => 'Ұлты',
                'placeholder' => 'Ұлтыңызды енгізіңіз'
            ]
        ],
        'buttons' => [
            'submit' => 'Құжат деректерін жаңарту',
            'profile' => 'Тіркелгі профилі',
            'bankCard' => 'Банк картасы'
        ],
        'modal' => [
            'title' => 'Жеке куәлікті жаңарту',
            'close' => 'Жабу'
        ]
    ],

    'myTickets' => [
        'title' => 'Менің билеттерім',
        'currency' => 'тг',
        'noTickets' => 'Билеттер әлі сатып алынған жоқ',
        'modal' => [
            'title' => 'Билет сатып алынды',
            'close' => 'Жабу'
        ],
    ],

    'profile' => [
        'title' => 'Тіркелгі профилі',
        'inputs' => [
            'name' => [
                'label' => 'Аты',
                'placeholder' => 'Атыңызды енгізіңіз'
            ],
            'surname' => [
                'label' => 'Тегі',
                'placeholder' => 'Фамилияңызды енгізіңіз'
            ],
            'middleName' => [
                'label' => 'Әкесінің аты (міндетті емес)',
                'placeholder' => 'Әкеңіздің атын енгізіңіз'
            ],
            'iin' => [
                'label' => 'Электрондық пошта',
                'placeholder' => 'Электрондық поштаңызды енгізіңіз'
            ],
            'birthDate' => [
                'label' => 'Туған күні'
            ]
        ],
        'buttons' => [
            'submit' => 'Профиль деректерін жаңарту',
            'idCard' => 'Жеке куәлік',
            'bankCard' => 'Банк картасы'
        ],
        'modal' => [
            'title' => 'Профильді жаңарту',
            'close' => 'Жабу'
        ]
    ],

    'searchResults' => [
        'form' => [
            'inputs' => [
                'from' => 'ЖӨНЕЛТУ',
                'to' => 'КЕЛУ',
                'departureTime' => 'ЖӨНЕЛТУ КҮНІ',
                'arrivalTime' => 'КЕЛУ КҮНІ'
            ],
            'submit' => 'Іздеу'
        ],
        'route' => [
            'title' => 'Маршрут туралы мәліметтер',
            'details' => [
                'from' => 'Кету орны:',
                'to' => 'Келу орны:',
                'departureTime' => 'Кету күні мен уақыты:',
                'arrivalTime' => 'Келу күні мен уақыты:',
                'price' => 'Бағасы:',
                'seats' => 'Орындар қалды:',
                'organizator' => 'Ұйымдастыру:',
                'transport' => [
                    'label' => 'Көлік:',
                    'type' => [
                        'airplane' => 'Ұшақ',
                        'bus' => 'Автобус',
                        'train' => 'Пойыз'
                    ]
                ]
            ],
            'button' => 'Себетке'
        ],
        'modal' => [
            'title' => 'Себетке қосу',
            'close' => 'Жабу'
        ],
        'noRoutes' => 'Маршруттар табылмады'
    ]
];